---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussClosedReference
source: html/c63ebc10-15ca-f79c-a7b7-9027e10d5310.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussClosedReference Property

Truss references (chains of one or more reference lines) should not form closed loops."

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussClosedReference { get; }
```